13/data/attachments/c2f0bd035531feee.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_2cb70124-95ac-4f18-a86e-728567f489ad</nif:username>
            <nif:friendToBeAdded>Colleen_budget_Actions_57038_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>